app/controllers/dashboard_controller.rb

  def get_suggestions
    condition_array = Array.new

    searchProcedure = params['procedure']
    searchDiagnosis = params['diagnosis']

    # if(searchDiagnosis == 'true')
    #   result = Condition.joins(
    #            "INNER JOIN procedures on conditions.code = procedures.code
    #             where conditions.consumer_name ILIKE '%#{params[:q]}%' AND conditions.condition_type='procedure' order by conditions.id")
    #             .select("conditions.id,conditions.consumer_name, procedures.id AS p_id, procedures.short_name")
    #   result.each do |c|
    #     element = Hash.new
    #     if c.consumer_name != ''
    #       element[:category] = "Diagnosis: " +  c.consumer_name
    #       element[:name] = c.short_name
    #       element[:id] = c.p_id
    #       condition_array << element
    #     end
    #   end
    # end

if(searchDiagnosis == 'true')
      result = Condition.joins(
               "INNER JOIN procedures on conditions.code = procedures.code
                where conditions.consumer_name ILIKE '%#{params[:q]}%' AND conditions.condition_type='diagnosis' order by conditions.id")
                .select("conditions.id,conditions.consumer_name, procedures.id AS p_id, procedures.short_name")
      result.each do |c|
---
SELECT conditions.id,conditions.consumer_name, procedures.id AS p_id, procedures.short_name FROM `conditions` LEFT JOIN procedures on conditions.codeset = procedures.codeset where conditions.consumer_name LIKE 'Dia%'
SELECT `conditions`.* FROM `conditions` LEFT OUTER JOIN procedures on conditions.codeset = procedures.codeset where conditions.consumer_name LIKE 'and%'

    # end

    if(searchProcedure == 'true')
        result = Procedure.where("short_name ILIKE '%#{params[:q]}%'")
---
SELECT `procedures`.* FROM `procedures`  WHERE (codeset IN (CPT4,HCPCS,ICD 10 CM,ICD 10 PCS,ICD 9 CM,ICD 9 PCS))